; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_1 ?v4 - type_3 ?v8 - type_2)
 	      (pred_4 ?v5 - object ?v8 - type_2)
	      (pred_2 ?v4 - type_3 ?v1 - type_1)
	      (pred_3 ?v4 - type_3 ?v5 - object ?v1 - type_1))

   (:action op_1
       :parameters  (?v4 - type_3 ?v2 ?v7 - type_2)
       :precondition (and  (pred_1 ?v4 ?v2))
       :effect (and  (pred_1 ?v4 ?v7)
		     (not (pred_1 ?v4 ?v2))))

   (:action op_2
       :parameters (?v4 - type_3 ?v6 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_4 ?v6 ?v3) (pred_1 ?v4 ?v3) (pred_2 ?v4 ?v1))
       :effect (and (pred_3 ?v4 ?v6 ?v1)
		    (not (pred_4 ?v6 ?v3)) 
		    (not (pred_2 ?v4 ?v1))))

   (:action op_3
       :parameters (?v4 - type_3 ?v6 - object ?v3 - type_2 ?v1 - type_1)
       :precondition  (and  (pred_3 ?v4 ?v6 ?v1) (pred_1 ?v4 ?v3))
       :effect (and (pred_4 ?v6 ?v3)
		    (pred_2 ?v4 ?v1)
		    (not (pred_3 ?v4 ?v6 ?v1)))))

; problem
(define (problem gripper-1-3-3)
(:domain gripper-strips)
(:objects obj_01 - type_3
obj_08 obj_02 - type_1
obj_03 obj_09 obj_05 - type_2
obj_07 obj_06 obj_04 - object)
(:init
(pred_1 obj_01 obj_03)
(pred_2 obj_01 obj_08)
(pred_2 obj_01 obj_02)
(pred_4 obj_07 obj_03)
(pred_4 obj_06 obj_09)
(pred_4 obj_04 obj_09)
)
(:goal
(and
(pred_4 obj_07 obj_09)
(pred_4 obj_06 obj_05)
(pred_4 obj_04 obj_03)
)
)

(:constraints
  (always (forall (?b - object)
           (not (pred_3 obj_01 ?b obj_02))))
)
)

; plan
1. (op_2 obj_01 obj_07 obj_03 obj_08)
   deleted: (pred_4 obj_07 obj_03) (pred_2 obj_01 obj_08)
   added: (pred_3 obj_01 obj_07 obj_08)
   goals met: 0 of 3
2. (op_1 obj_01 obj_03 obj_09)
   deleted: (pred_1 obj_01 obj_03)
   added: (pred_1 obj_01 obj_09)
   goals met: 0 of 3
3. (op_3 obj_01 obj_07 obj_09 obj_08)
   deleted: (pred_3 obj_01 obj_07 obj_08)
   added: (pred_4 obj_07 obj_09) (pred_2 obj_01 obj_08)
   goals met: 1 of 3
4. (op_2 obj_01 obj_06 obj_09 obj_08)
   deleted: (pred_4 obj_06 obj_09) (pred_2 obj_01 obj_08)
   added: (pred_3 obj_01 obj_06 obj_08)
   goals met: 1 of 3
5. (op_1 obj_01 obj_09 obj_05)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_05)
   goals met: 1 of 3
6. (op_3 obj_01 obj_06 obj_05 obj_08)
   deleted: (pred_3 obj_01 obj_06 obj_08)
   added: (pred_4 obj_06 obj_05) (pred_2 obj_01 obj_08)
   goals met: 2 of 3
7. (op_1 obj_01 obj_05 obj_09)
   deleted: (pred_1 obj_01 obj_05)
   added: (pred_1 obj_01 obj_09)
   goals met: 2 of 3
8. (op_2 obj_01 obj_04 obj_09 obj_08)
   deleted: (pred_4 obj_04 obj_09) (pred_2 obj_01 obj_08)
   added: (pred_3 obj_01 obj_04 obj_08)
   goals met: 2 of 3
9. (op_1 obj_01 obj_09 obj_03)
   deleted: (pred_1 obj_01 obj_09)
   added: (pred_1 obj_01 obj_03)
   goals met: 2 of 3
10. (op_3 obj_01 obj_04 obj_03 obj_08)
   deleted: (pred_3 obj_01 obj_04 obj_08)
   added: (pred_4 obj_04 obj_03) (pred_2 obj_01 obj_08)
   goals met: 3 of 3
